Enums/СтатусыВнутреннихЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыВнутреннихЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьКОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыВнутреннихЗаказов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список выбора статуса, в зависимости от включенных опций
//
// Параметры:
//  ДанныеВыбора			 - СписокЗначений	 - заполняемый список значений
//  ИспользоватьСтатусЗакрыт - Булево			 - признак необходимости использования статуса "Закрыт".
//  ИспользоватьСтатусНаСогласовании - Булево	 - признак необходимости использования статуса "НаСогласовании".
//
Процедура ЗаполнитьСписокВыбора(ДанныеВыбора, ИспользоватьСтатусЗакрыт, ИспользоватьСтатусНаСогласовании) Экспорт
	
	ДанныеВыбора.Очистить();
	
	Если ИспользоватьСтатусНаСогласовании Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.НаСогласовании);
	КонецЕсли;
	
	// Безусловные статусы
	ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	
	Если ИспользоватьСтатусЗакрыт Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.Закрыт);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
